In [38]:
"""
    Helpful Functions Module
    Provides basic data science functionality
"""


import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split


def tt_split(df, frac):


    """
        Returns the training and testing dataframes,
        where frac = fraction of df set aside for testing
    """


    df = df.copy()
    train, test = train_test_split(df, train_size=frac)

    return train, test


def null_count(df):

    """
        Returns the sum of nulls in a dataframe
    """


    df = df.copy()
    sum = 0

    for col in df.columns:
        sum += df[col].isnull().sum()

    return sum


def list_to_series(list, df):

    """
        Transforms a python list/array into a pandas series,
        then returns the dataframe with the new series as a column.
    """

    df = df.copy()
    series = pd.Series(list)
    series.name = 'f'
    new_df = df.join(series)

    return new_df

In [20]:
df = pd.DataFrame(
    {
      'a': [1, 2, 3, 4, 5, 6],
      'b': [2, np.NaN, 10, 23, np.NaN, 38],
      'c': [np.NaN, 5, 12, 21, 0, 54],
      'd': [np.NaN, np.NaN, np.NaN, 14, 5, 46],
      'e': [5, 17, 3, np.NaN, 8, 72]
    })

df

   a     b     c     d     e
0  1   2.0   NaN   NaN   5.0
1  2   NaN   5.0   NaN  17.0
2  3  10.0  12.0   NaN   3.0
3  4  23.0  21.0  14.0   NaN
4  5   NaN   0.0   5.0   8.0
5  6  38.0  54.0  46.0  72.0

In [39]:
arr = [9, 6, 3, 5, 20, 80]
list_to_series(arr, df)

   a     b     c     d     e   f
0  1   2.0   NaN   NaN   5.0   9
1  2   NaN   5.0   NaN  17.0   6
2  3  10.0  12.0   NaN   3.0   3
3  4  23.0  21.0  14.0   NaN   5
4  5   NaN   0.0   5.0   8.0  20
5  6  38.0  54.0  46.0  72.0  80